Revit 2024 API
AnalysisDisplayColorEntry Members
The AnalysisDisplayColorEntry type exposes the following members.
Constructors
Name | Description
AnalysisDisplayColorEntry()
 Constructs a new AnalysisDisplayColorEntry with default settings.
AnalysisDisplayColorEntry(Color)
 Constructs a color entry with no value assigned.
AnalysisDisplayColorEntry(Color, Double)
 Constructs a color entry with a specific value assigned.
Methods
Name | Description
Dispose
Releases all resources used by the AnalysisDisplayColorEntry
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
HasValue
 Check if color entry has associated value.
IsEqual
 Compare color entries.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Color
 Color associated with color entry.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Value
 Value associated with color entry.
See Also
AnalysisDisplayColorEntry Class
Autodesk.Revit.DB.Analysis Namespace